## TASK-4 
## QST -1
 Import pandas and read the data into a DataFrame. Print the first 5 rows of the DataFrame.

In [1]:
import pandas as pd 
import warnings
warnings.filterwarnings("ignore")

In [2]:
data= pd.read_csv("D:\padas_question.csv")

In [3]:
data

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York
5    Frank    Male   40          190           85      Houston
6    Grace  Female   32          168           55      Chicago
7    Henry    Male   45          175           75  Los Angeles
8      Ivy  Female   26          172           63        Miami
9     Jack    Male   28          180           78     New York

In [4]:
data.head(5)

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York

## Qst-2
   Print the number of rows and columns in the DataFrame.

In [5]:
data.shape

(10, 6)

## QSt-3
 Print the null value count

In [6]:
data.isnull().count()

Name           10
Gender         10
Age            10
Height (cm)    10
Weight (kg)    10
City           10
dtype: int64

## Qst-4
 Print the average age, height, and weight of the people in the DataFrame.

In [7]:
data.describe()

             Age  Height (cm)  Weight (kg)
count  10.000000    10.000000    10.000000
mean   31.600000   175.000000    68.900000
std     6.552353     7.133645    10.246409
min    25.000000   165.000000    55.000000
25%    27.250000   170.500000    60.750000
50%    29.000000   175.000000    67.500000
75%    34.250000   178.750000    77.250000
max    45.000000   190.000000    85.000000

In [8]:
data['Age'].mean()

31.6

In [9]:
data['Height (cm)'].mean()

175.0

In [10]:
data['Weight (kg)'].mean()

68.9

## Qst-5
Print the name and city of the person who is the tallest in the DataFrame.

In [11]:
data.nlargest(1,'Height (cm)')

    Name Gender  Age  Height (cm)  Weight (kg)     City
5  Frank   Male   40          190           85  Houston

## Qst-6
    Create a new column in the DataFrame called "BMI" that calculates the body mass index of each person. BMI iscalculated as weight (kg) divided by height (m) squared. Print the DataFrame with the new column.

In [12]:
df=pd.DataFrame(data)

# Create new column for BMI
data['BMI'] = data['Weight (kg)'] / (data['Height (cm)'] ** 2)

# Print DataFrame with new column
print(data)

      Name  Gender  Age  Height (cm)  Weight (kg)         City       BMI
0    Alice  Female   25          165           58     New York  0.002130
1      Bob    Male   30          180           80  Los Angeles  0.002469
2  Charlie    Male   35          175           70      Chicago  0.002286
3    Diana  Female   28          170           65        Miami  0.002249
4      Eva  Female   27          175           60     New York  0.001959
5    Frank    Male   40          190           85      Houston  0.002355
6    Grace  Female   32          168           55      Chicago  0.001949
7    Henry    Male   45          175           75  Los Angeles  0.002449
8      Ivy  Female   26          172           63        Miami  0.002130
9     Jack    Male   28          180           78     New York  0.002407

In [13]:
df

      Name  Gender  Age  Height (cm)  Weight (kg)         City       BMI
0    Alice  Female   25          165           58     New York  0.002130
1      Bob    Male   30          180           80  Los Angeles  0.002469
2  Charlie    Male   35          175           70      Chicago  0.002286
3    Diana  Female   28          170           65        Miami  0.002249
4      Eva  Female   27          175           60     New York  0.001959
5    Frank    Male   40          190           85      Houston  0.002355
6    Grace  Female   32          168           55      Chicago  0.001949
7    Henry    Male   45          175           75  Los Angeles  0.002449
8      Ivy  Female   26          172           63        Miami  0.002130
9     Jack    Male   28          180           78     New York  0.002407

## QSt-7
Group the data by gender and print the average age, height, and weight of males and females separately.

In [14]:
grouped = df.groupby('Gender').mean()

In [15]:
grouped

         Age  Height (cm)  Weight (kg)       BMI
Gender
Female  27.6        170.0         60.2  0.002083
Male    35.6        180.0         77.6  0.002393

In [16]:
print(grouped[['Age', 'Height (cm)', 'Weight (kg)']])

         Age  Height (cm)  Weight (kg)
Gender
Female  27.6        170.0         60.2
Male    35.6        180.0         77.6

## Qst- 8
Sort the data by age in ascending order and print the first 3 rows of the sorted DataFrame.

In [17]:
df.sort_values('Age', ascending=False).head(3)

      Name Gender  Age  Height (cm)  Weight (kg)         City       BMI
7    Henry   Male   45          175           75  Los Angeles  0.002449
5    Frank   Male   40          190           85      Houston  0.002355
2  Charlie   Male   35          175           70      Chicago  0.002286

## Qst-9
    Filter the data to only include people who live in New York and print the resulting DataFrame.

In [18]:
df

      Name  Gender  Age  Height (cm)  Weight (kg)         City       BMI
0    Alice  Female   25          165           58     New York  0.002130
1      Bob    Male   30          180           80  Los Angeles  0.002469
2  Charlie    Male   35          175           70      Chicago  0.002286
3    Diana  Female   28          170           65        Miami  0.002249
4      Eva  Female   27          175           60     New York  0.001959
5    Frank    Male   40          190           85      Houston  0.002355
6    Grace  Female   32          168           55      Chicago  0.001949
7    Henry    Male   45          175           75  Los Angeles  0.002449
8      Ivy  Female   26          172           63        Miami  0.002130
9     Jack    Male   28          180           78     New York  0.002407

In [19]:
ny_df = df[df['City'] == 'New York']

In [20]:
ny_df # new data frame

    Name  Gender  Age  Height (cm)  Weight (kg)      City       BMI
0  Alice  Female   25          165           58  New York  0.002130
4    Eva  Female   27          175           60  New York  0.001959
9   Jack    Male   28          180           78  New York  0.002407